IdeaRS.Connections
ConnectorGridData.MainConnectedBeam Property
Compatible with IDEA StatiCa 0.0
 Gets or sets the main connected beam (if the main plate is part of the connected beam, if it is independent plate this property is null)
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public string MainConnectedBeam { get; set; }
Property Value
Type: String
See Also
Reference
ConnectorGridData Class
IdeaRS.Connections.Data Namespace